app/Controllers/Cadastros.php

    public function getImoveisByUsuario($usuario)
    {
        $imovelModel = new \App\Models\ImovelModel();
        $imoveis = $imovelModel->where('Usuario', $usuario)->findAll();
---
SELECT *
FROM `imovel`
WHERE `Usuario` = 'adm'