app/Controllers/Home.php

SELECT *
FROM `endereco`
WHERE `ID_Endereco` = '8'
---
    public function imovel($id)
    {

        $imovelModel = new \App\Models\ImovelModel();

        $imovel = $imovelModel->getimovelByID($id);

        $enderecoModel = new \App\Models\enderecoModel();

        $enderecoModel->where('ID_Endereco',$imovel[0]['ID_Endereco']);
        $enderecoImovel = $enderecoModel->findAll();