app/Models/imovelModel.php

    public function getimovel (){

        //$query = $this->db->query('select * from clientes;');

        $query = $this->db->table('imovel')->get();
---
SELECT *
FROM `imovel`

    public function getimovelByID ($id){

        $query = $this->db->table('imovel')->where('ID_imovel', $id)->get();
---
SELECT *
FROM `imovel`
WHERE `ID_imovel` = '11'