app/Models/UsuarioModel.php

    public function AuthLogin($usuario, $senha) {

        $query = $this->db->table('usuario')
                         ->where('usuario', $usuario)
                         ->where('senha', $senha)
                         ->get();
---
SELECT *
FROM `usuario`
WHERE `usuario` = 'Nick'
AND `senha` = 'nick'